Revit 2024 API
DoubleClickAction Enumeration
 Possible actions Revit can take in response to the user double-clicking on an element.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum DoubleClickAction
Visual Basic
Public Enumeration DoubleClickAction
Visual C++
public enum class DoubleClickAction
Members
Member name | Description
NoAction |  Double-clicks should be ignored.
EditFamily |  Double-click should open the family for editing.
EditType |  Double-click should take the user to the edit type dialog.
ActivateView |  Double-click should activate the view or schedule.
EnterEditMode |  Double-click will enter a specific edit mode for the element.
DeactivateView |  Double-click should deactivate the active view.
See Also
Autodesk.Revit.UI Namespace